app/views/questions/display.html.erb

SELECT "users".* FROM "users" WHERE "users"."uid" = 1048612677 LIMIT 1
---
        <% @answers.each do |answer| %>
        <% user = User.find_by_uid(answer.user_id) %>