app/controllers/answers_controller.rb

  def create
    if current_user
      uid = current_user.uid
      answer = Answer.add_answer(params, uid)
      user_name = current_user.name
      if answer.anonimity
        user_name = 'Anonymous'
      end
      render :json => {
        :user => user_name,
        :answer => answer.answer,
        :timestamp => answer.created_at.in_time_zone('Eastern Time (US & Canada)').strftime('%A, %B %d, %Y at %I:%M %p %Z'),
        :answer_id => answer.id
---
INSERT INTO "answers" ("anonimity", "answer", "created_at", "question_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)

  def delete
    answer = Answer.find_by_id(params[:id])
    if answer.user_id == current_user.uid.to_i
      answer.destroy
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = 25 LIMIT 1
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 25]]