app/controllers/questions_controller.rb

  def display
    @question = Question.find_by_slug(params[:slug])
    if @question
      @user = User.find_by_uid(@question.user_id)
      @recent_questions = Question.all(:order => 'created_at DESC', :limit => 10)
---
SELECT "questions".* FROM "questions" WHERE "questions"."slug" = 'Where-is-MIT' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."uid" = 1048612677 LIMIT 1
SELECT "questions".* FROM "questions" ORDER BY created_at DESC LIMIT 10