app/controllers/sessions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."user_id" = 1048612677 LIMIT 1
SELECT "questions".* FROM "questions" ORDER BY created_at DESC LIMIT 10
---
  def home
    if current_user
      @questions = Question.where(:user_id => current_user.uid).all
      @recent_questions = Question.all(:order => 'created_at DESC', :limit => 10)